In [99]:
import numpy as np
import pandas as pd

# Series

In [100]:
pd.Series(data=[10,20,30])

0    10
1    20
2    30
dtype: int64

In [101]:
pd.Series(data=[10,20,30], index = 'a b c'.split())

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(data=np.array([10,20,30]))

0    10
1    20
2    30
dtype: int32

In [103]:
pd.Series(data=np.array([10,20,30]), index = 'a b c'.split())

a    10
b    20
c    30
dtype: int32

In [104]:
ser1 = pd.Series(data=[1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])       
ser2 = pd.Series(data=[1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [105]:
ser1['Japan']

4

In [106]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DATA FRAMES

In [107]:
from numpy.random import randn

In [108]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [109]:
df

          W         X         Y         Z
A -0.199887 -0.412912  0.240552  0.433139
B -1.197601 -1.226444 -0.430089 -0.677454
C -0.841968 -1.288980  0.903140 -0.913765
D  0.306544  1.729604  1.104584 -2.537326
E -1.136991  1.011253 -1.721946 -2.458290

Transpor

In [110]:
df.transpose()

          A         B         C         D         E
W -0.199887 -1.197601 -0.841968  0.306544 -1.136991
X -0.412912 -1.226444 -1.288980  1.729604  1.011253
Y  0.240552 -0.430089  0.903140  1.104584 -1.721946
Z  0.433139 -0.677454 -0.913765 -2.537326 -2.458290

Selecionar coluna

In [111]:
df['X']

A   -0.412912
B   -1.226444
C   -1.288980
D    1.729604
E    1.011253
Name: X, dtype: float64

In [112]:
df[['X','Y']]

          X         Y
A -0.412912  0.240552
B -1.226444 -0.430089
C -1.288980  0.903140
D  1.729604  1.104584
E  1.011253 -1.721946

Criar coluna

In [113]:
df['Col'] = df['X']*2
df

          W         X         Y         Z       Col
A -0.199887 -0.412912  0.240552  0.433139 -0.825823
B -1.197601 -1.226444 -0.430089 -0.677454 -2.452889
C -0.841968 -1.288980  0.903140 -0.913765 -2.577960
D  0.306544  1.729604  1.104584 -2.537326  3.459208
E -1.136991  1.011253 -1.721946 -2.458290  2.022505

Remover coluna

In [114]:
df.drop('Col',axis=1,inplace=True)
df
#necessário o inplace para confirmar

          W         X         Y         Z
A -0.199887 -0.412912  0.240552  0.433139
B -1.197601 -1.226444 -0.430089 -0.677454
C -0.841968 -1.288980  0.903140 -0.913765
D  0.306544  1.729604  1.104584 -2.537326
E -1.136991  1.011253 -1.721946 -2.458290

Selecionar linha

In [115]:
df.loc['C']

W   -0.841968
X   -1.288980
Y    0.903140
Z   -0.913765
Name: C, dtype: float64

In [116]:
# Procurar pelo índice
df.iloc[2]

W   -0.841968
X   -1.288980
Y    0.903140
Z   -0.913765
Name: C, dtype: float64

Selecionar conjunto de linhas e colunas

In [117]:
df.loc['B','Y']

-0.43008892375895214

In [118]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.199887  0.240552
B -1.197601 -0.430089

Remover linha

In [119]:
df.drop('E',axis=0, inplace=True)
df

          W         X         Y         Z
A -0.199887 -0.412912  0.240552  0.433139
B -1.197601 -1.226444 -0.430089 -0.677454
C -0.841968 -1.288980  0.903140 -0.913765
D  0.306544  1.729604  1.104584 -2.537326

# Multi-Index

In [120]:
hier_index = list(zip(['G1','G1','G1','G2','G2','G2'],[1,2,3,1,2,3]))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [121]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.698187 -1.291330
   2  0.048965 -0.537197
   3 -0.373537 -0.786498
G2 1  0.672573 -0.662979
   2  1.116287 -0.425292
   3  2.602719  0.539956

In [122]:
df.loc['G1']

          A         B
1  1.698187 -1.291330
2  0.048965 -0.537197
3 -0.373537 -0.786498

Mudar nome

In [123]:
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1    1.698187 -1.291330
      2    0.048965 -0.537197
      3   -0.373537 -0.786498
G2    1    0.672573 -0.662979
      2    1.116287 -0.425292
      3    2.602719  0.539956

Outra forma de vizualizar

In [125]:
df.xs(1,level='Num')

              A         B
Group
G1     1.698187 -1.291330
G2     0.672573 -0.662979

In [126]:
df.xs('G1',level='Group')

            A         B
Num
1    1.698187 -1.291330
2    0.048965 -0.537197
3   -0.373537 -0.786498

# Missing Data

In [127]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Remover colunas ou linhas com elementos nulos

In [128]:
df.dropna(axis = 0, thresh = 3)
# thresh serve como número mínimo de elementos não nulos para não ser removido

     A    B  C
0  1.0  5.0  1

In [129]:
df.dropna(axis = 1, thresh = 3)

   C
0  1
1  2
2  3

Preencher os elementos nulos com certo valor

In [130]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

## Groupby

In [131]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [132]:
df.groupby('Company').describe()
# Contém as principais funções do groupby

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

 ## Concatenar

In [135]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [136]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [137]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [138]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [139]:
pd.concat([df1,df2], axis = 0)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [140]:
pd.concat([df1,df2], axis = 1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

## Merge

In [141]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [142]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [143]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [144]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## Joining

In [146]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [147]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [148]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# MICELANIOUS

In [150]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [151]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [152]:
df['col2'].nunique()

3

In [153]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Applying Functions

In [155]:
def times2(x):
    return x*2

In [158]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [159]:
df['col1'].sum()

10